{"title":"Living in Suwon, Korea","description":"First of all, let me clear out that I’m not a blogger, and definitely not asequipped in English as I would say I’m in JavaScript.","date":"2016-11-27T11:48:44.318Z","categories":"[]","keywords":["travel","south korea","suwon","seoul","sikh","vegetarian"],"slug":"living-in-suwon-korea-11-27-2016","image":"img/blog/1__sCPawDEOQs9dTX5wPN4e__A.jpeg","html":"First of all, let me clear out that I’m not a blogger, and definitely not as equipped in English as I would say I’m in JavaScript.<br />Now that’s been established, let’s talk about me, Samsung and Suwon.<h3>Me</h3>A Sikh Male rocking sick beard with a Punjabi Turban, and Orange Gaatra that holds a long <a href=\"https://en.wikipedia.org/wiki/Kirpan\">Kirpan</a>.<br /><img src=\"img/blog/1__sCPawDEOQs9dTX5wPN4e__A.jpeg\" alt=\"A Sikh Male rocking sick beard with a Punjabi Turban, and Orange Gaatra that holds a long Kirpan\"><br />I’m a <a href=\"http://www.sikhiwiki.org/index.php/Main_Page\">Sikh</a> male who graduated from <a href=\"http://nsit.ac.in/\">NSIT</a>, <a href=\"https://en.wikipedia.org/wiki/New_Delhi\">New Delhi</a> in Computer Engineering discipline in 2016. Before starting off my engineering career, I’d developed horrible Visual Basic applications and knew exactly what I wanted to do in my life; create <a href=\"https://www.youtube.com/watch?v=d5LzH2sh1rk\">stupid</a> UIs with no knowledge of design. After joining the college, I made a very sane unintentional decision of learning JavaScript to make websites/webapps. Back then, JavaScript wasn’t even looked upon as a serious language, NodeJS was in its baby years of popularity, and using jQuery was cool. But I don’t know why, I kept coding in it. And this very thing and some luck landed me up in a summer internship at Samsung R&D Institute, Bangalore where I worked on a NodeJS project. And that lead me to,,, wait, I need to start a Samsung heading.<h3>Samsung</h3><img src=\"img/blog/1____g5l9BybNJiUO22dNPEeYg.jpeg\" alt=\"Samsung Digital City, Suwon\">\nSamsung Digital City, Suwon<br />Yeah, so that lead me to a full time job at SRIB, which again lead me to Suwon, the place where HQ of Samsung Electronics resides. I’m part of Web Team in SRIB, that is also responsible for <a href=\"https://medium.com/samsung-internet-dev\">Samsung Internet</a>, and I am currently overhauling the <a href=\"https://chrome.google.com/webstore/detail/samsung-sync/epejdmjgfibjaffbmojllapapjejipkh?hl=en\">Samsung Sync extension</a>. Expect a major update soon!<br />It’s funny how the ship of JavaScript sailed me across from one island to another. And now, I’m typing this from Suwon as my last week of business trip is about to start.<br />I love the wide range of technologies that exist within Samsung Electronics. This provides a great canvas for freshers to try and experiment with all domains without having to switch jobs.<h3>Korea</h3>This last week has brought several memories of this 2 month stay in Korea, which in turn encouraged me to write this post on a Sunday evening.<br /><img src=\"img/blog/1__ng__tz1ZRfUcuEaSPWdKFdQ.jpeg\" alt=\"Somewhere in Suwon\">\nSomewhere in Suwon<br />The country is amazing, it’s a developed nation, which is a thing a citizen of a developing nation would observe first. The racial and social security is really great here, in contrast to west where <a href=\"https://en.wikipedia.org/wiki/Islamophobia\">Islamophobia</a> is a big deal. And the people are really humble. I love how everyone greets you and bows down a little, they take out time to wish you well, and that’s heart warming for a foreigner.<br /><img src=\"img/blog/1__qDzv5NoBmcDetWPiftOj__A.jpeg\" alt=\"Hotel staff at DreamVill\">\nHotel staff at DreamVill<br />I was lucky enough to witness both falls; fall fall and first snowfall, former being a phenomenon that doesn’t really exist in India.<br /><img src=\"img/blog/1__KvkZ__uwm7oa3ENgorLT5ug.jpeg\" alt=\"\">\n<img src=\"img/blog/1__BrdQH1cUwbrbO6MO7QF__aQ.jpeg\" alt=\"Fall Leaves\">\nFall Leaves<br /><img src=\"img/blog/1__zRKNo__JVjQFn2EOCwQ1QNA.gif\" alt=\"Snow Falls\">\nSnow Falls<br />However, as a vegetarian I found myself at great discomfort in finding food outside DreamVill that serves Indian cuisine. So for vegetarian/vegan visitors, please bring some packaged food if you’re planning a long visit.<br /><a href=\"https://www.google.co.kr/maps/place/Hwaseong+Fortress/@37.2807935,127.0102456,15z/data=!4m2!3m1!1s0x0:0x809c61d30ab56214?sa=X&ved=0ahUKEwipktCA7sjQAhWFybwKHUA4B8QQ_BIIgwEwDg\">Hwaseong Fortress</a></a><br /><a href=\"img/blog/1__RDHDZhOnDTUKypNH__vp1wQ.jpeg\">Imagee of Hwaseong Fortress</a><br />Some places like <a href=\"https://www.google.com/maps/place/%ED%8C%8C%EB%A6%AC%EB%B0%94%EA%B2%8C%EB%9C%A8+%EC%98%81%ED%86%B5%EB%89%B4%EC%9B%94%EB%93%9C%EC%A0%90/@37.2536243,127.0674148,15z/data=!4m8!1m2!2m1!1sparis+baguette!3m4!1s0x0:0x794b659d3dad89b8!8m2!3d37.2520187!4d127.0710522?hl=en\">Paris Baguette</a>, <a href=\"https://www.google.com/maps/place/%EB%9A%9C%EB%A0%88%EC%A5%AC%EB%A5%B4/@37.2536913,127.0674148,15z/data=!4m8!1m2!2m1!1sTous+Les+Jours!3m4!1s0x357b44c4c1f2a6bd:0xb1aff268e48c54e2!8m2!3d37.2520193!4d127.0709693?hl=en\">Tous Les Jours</a> etc. are good to look for vegan/vegetarian bread or salad sandwiches. If you’re lucky enough, you can find meat-free salads at bakeries and eateries of the like however.<br /><img src=\"img/blog/1__axarHRa8ZbcIwJwJr2xGoA.jpeg\" alt=\"Early Christmas Decorations in Seoul\">\nEarly Christmas Decorations in Seoul<br />There are various tourist places that you can visit, though I primarily remained near the city. As a Sikh, it was pleasant surprise to find a <a href=\"https://en.wikipedia.org/wiki/Gurdwara\">Gurdwara</a> in the country however. Run by primarily the <a href=\"https://en.wikipedia.org/wiki/Punjabis\">Punjabi</a> community, the Gurdwara is well maintained and open to all. I visited it during lunch time and it was lovely to find everyone enjoying <a href=\"https://en.wikipedia.org/wiki/Langar_%28Sikhism%29\">Langar</a> together on a Sunday noon.<br /><img src=\"img/blog/1__x9oZ2fWNHKVWgEap__5YoCA.jpeg\" alt=\"Image of Gurdwara\">\n<a href=\"https://www.google.co.kr/maps/place/Gurudwara+Shri+Singh+Sabha/@37.8185614,127.1303603,15z/data=!4m2!3m1!1s0x0:0x7b23842b65fbbbd4?sa=X&ved=0ahUKEwjH0eHk7MjQAhVRNrwKHfTaBL8Q_BIIggEwCg\">Gurdwara Shri Singh Sabha Sahib</a><h3>Closing Note</h3>So as I begin packing for my return flight to India, I wish to thank every Korean that has helped me find my way and replied with an <a href=\"http://www.123rf.com/photo_8638384_serious-and-determined-young-man-makes-an-x-shape-with-his-arms-and-hands-this-could-mean-stop-cross.html\">arm cross</a> to my search of vegetarian food. Your country is amazing, and I definitely wish to visit it again, hopefully after learning Korean. Gamsahamnida :)<br />Stick around to see more random blog posts from this idiot."}