{"pageProps":{"post":{"title":"How Holi is related to narcissism and patriarchy","description":"My views on emotional abuse done by narcissistic parents and how the epic of Bhagat Prahlad relates to it.","date":"2021-03-22T06:02:13.793Z","categories":"[spirituality, sikhi]","keywords":["prahlad","emotional abuse","narcissistic parents","sikhi","hindu mythology"],"slug":"how-holi-is-related-to-narcissism-and-patriarchy-3-22-2021","isDraft":false,"image":"../../public/img/blog/prahlad-1.jpg","html":"<blockquote>\n<p>Originally a <a href=\"https://twitter.com/i/status/1373926490279178245\">Twitter Thread</a>.</p>\n</blockquote>\n<p>With Holi coming up and me witnessing a lot of turmoil in my personal life, I was forced to think about Holi in a very specific way. At risk of over-simplifying and appropriating the narrative, here are my unpopular views on the epic of Bhagat Prahlad and how it relates with narcissism and toxic patriarchy.</p>\n<p><img src=\"../../public/img/blog/prahlad-1.jpg\" alt=\"Bhagat Prahlad in pyre chanting Ram Ram while his father watches him burn\"></p>\n<p>If you are to believe the ancient epic of Bhagat Prahlad and Hirnaykashyap, AKA Harnaakash in Sikhi, you'll find some interesting things around patriarchal family dynamics. There was an ideological difference between Prahlad and his father. His father felt superior and he felt that he was worthy of worship. This inflated self-view was further exemplified by the fact that his province &#x26; society agreed, thanks to his boon of invincibility.</p>\n<p><img src=\"../../public/img/blog/prahlad-2.jpg\" alt=\"Prahlad in lap of his angry father\"></p>\n<p>Prahlad, on other hand, by grace of his own wisdom given by Narad, believed Vishnu to be his God. This was completely unacceptable to his narcissist father. Prahlad's defiance was followed by series of attempts by his father to get his son to conform to his ideology.</p>\n<p><img src=\"../../public/img/blog/prahlad-3.jpg\" alt=\"Narad giving spiritual wisdom to Prahlad&#x27;s pregnant mother\"></p>\n<p>While the world around Hirnaykashyap believed him to be equivalent of God, Prahlad didn't bow down to his teachers, friends, sister and as well as his mother. He stood against and outright fought the entire world for his right to lead his life his way.</p>\n<p><img src=\"../../public/img/blog/prahlad-4.jpg\" alt=\"Prahlad thrown off cliff only to be protected by Vishnu\"></p>\n<p>Imagine what a typical patriarchal mindset person in that era would have said. Wouldn't they instruct Prahald to leave his ego and just bow down to his parents? After all, his mother nurtured and nourished him, and his father took care of him, isn't it his moral obligation?</p>\n<p><img src=\"../../public/img/blog/prahlad-5.jpg\" alt=\"Prahlad preaching his friends about Vishnu\"></p>\n<p>Guru Amardaas Jee, 3rd Guru of Sikhs, in his <a href=\"http://sttm.co/s/4054/48255\">rendition</a> of the epic, shows how Prahlad talks back to his own mother.</p>\n<p><img src=\"../../public/img/blog/prahlad-6.jpg\" alt=\"Shabad in Guru Granth Sahib showing how Bhagat Prahlad defies his mother\"></p>\n<p>Ultimately, after multiple attempts of coercing Prahlad, including multiple attempts of murder for not agreeing with his father, Prahlad was protected by Narsingh (an avatar of Vishnu) after He killed his father, thanks to some loop-hole in the invincibility spell.</p>\n<p><img src=\"../../public/img/blog/prahlad-7.jpg\" alt=\"Narsingh killing Hirnaykashyap\"></p>\n<p>My point over here is that, since bygones we know of narcissism &#x26; toxic patriarchy, and this story shows how a minor stood up against something he believed to be false and didn't bow down at all. In the world of obedient <a href=\"https://en.wikipedia.org/wiki/Shravan\">Shravan Kumar</a> &#x26; Raam, we also have disobedient Prahald.</p>\n<p><img src=\"../../public/img/blog/prahlad-8.jpg\" alt=\"Shravan Kumar carrying his disabled parents\"></p>\n<p>Whether you believe children should indeed never defy their parents, or that Prahlad was an exception because he was a devotee of Vishnu, truth is that Prahlad wasn't supported by anyone he could rely on (his parents, siblings, friends or school) but he didn't conform to them.</p>\n<p>In my opinion, the notion that children must be obedient to their parents is rejected by this story. Whether Prahlad was right or wrong, that's a separate ideological question, but we all can agree that children have been defying parents since bygones &#x26; Sikhi even celebrates that.</p>\n<p>The number of times Prahlad's story is mentioned in Sikhi, makes me feel that Gurus didn't really want Sikhs to become obedient children of their parents, but rather be autonomous and sovereign. Defiance against old systems is pretty much a norm in Sikhi.</p>\n<p>Controlling parents and emotional abuse by narcissistic parents is not a new story, and it even needed intervention by Vishnu themself to save Prahlad.</p>\n<p>If you're a victim of such emotional abuse by controlling parents, you may take inspiration from this epic.</p>\n","fileName":"How Holi is related to narcissism and patriarchy.md"}},"__N_SSG":true}